#Цикл я зробив для того щоб код був циклічним
#міг зберігати назви фільмів та щоб не треба було перезапускати програму кожен раз
#\v я випадково знайшов але виглядає прикольно тому чому б і ні
films = []
while True:
    print("-------------------")
    print("\vFilmList\v")
    print("Можливі дії:\n 1.Додати фільм. \n 2.Переглянути список. \n 3.Видалити зі списку\n 4.Вийти")

    choice1 = input("Виберіть дію:")
    if choice1 == "1":
        choice2 = input("Введіть новий фільм:")
        films.append(choice2)
        print(f"Фільм {choice2} успішно додано")
    elif choice1 == "2":
        print(films)
    elif choice1 == "3":
        choice3 = input("Що хочете видалити?")
        print(f"Фільм {choice3} успішно видалено!")
    elif choice1 == "4":
        print("Завершення програми")
        break
    else:
        print("такої команди немає")
